pokedex-rails-backend/app/views/api/pokemon/show.json.jbuilder

json.type @pokemon.poke_type
json.moves @pokemon.moves.map(&:name)
---
SELECT "moves".* FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 2]]